In [1]:
import pandas as pd

In [2]:
# when data is arranged is columns

In [3]:
names=["Harshad","Mohit","Kunal"]
hobbies=["Cricket","Football","Running"]
height=[170,172,150]

In [10]:
info=pd.DataFrame({
    "Name":names,
    "Height":height,
    "Hobby":hobbies    
})
info

      Name  Height     Hobby
0  Harshad     170   Cricket
1    Mohit     172  Football
2    Kunal     150   Running

In [11]:
info.set_index("Name",inplace=True)
info

         Height     Hobby
Name
Harshad     170   Cricket
Mohit       172  Football
Kunal       150   Running

In [12]:
# when data is arranged in rows

In [13]:
row1=["Harshad","Cricket",170]
row2=["Mohit","Football",172]
row3=["Kunal","Running",150]

In [15]:
info2=pd.DataFrame(data=[row1,row2,row3],columns=["Name","Hobby","Height"])
info2

      Name     Hobby  Height
0  Harshad   Cricket     170
1    Mohit  Football     172
2    Kunal   Running     150

In [17]:
# Dataframe from Series

In [19]:
df=pd.Series(data=names , name="Name").to_frame()
df

      Name
0  Harshad
1    Mohit
2    Kunal

In [20]:
df["Hobby"]=hobbies

In [21]:
df

      Name     Hobby
0  Harshad   Cricket
1    Mohit  Football
2    Kunal   Running